#1
print(("№1"), 17/2*3+2, 2+17/2*3, 19%4+15/2*3, 15+6-10*4, 17/2%2*3**3)

#2
print(("№2"), (17/2)*(3+2), (2+17)/2*3, 19%(4+15)/2*3, (15+6-10)*4, 17/2%(2*3**3))

#3
have = 11
bread = 1.50
print(("№3"), 11 - 3 * 1.50, "рублей осталось")

#4
anna = 2
pol = 5
print(("№4"), 'У Анны', anna, 'яблока,', 'у Пола', pol, 'яблок.')

#5
days = 5
print(("№5"), "5 суток =", days * 24, "часов =", days * 24 * 60, "минут =", days * 24 * 60 * 60, "секунд")

#6
days = 182
weeks = days // 7
print(("№6"), weeks, "полных недель")

#7
side_1 = 150
side_2 = 65
squre = 30
squres = (150 // 30) * (65 // 30)
print("№7", "Можно отрезать", squres, "квадратов")

#8
seconds = 4000
hours = seconds // 3600
minutes = 400 // 60
seconds = 40
print(("№8"), hours, "час", minutes, "минут", seconds, "секунд")

#9
cash = 361
hundred = cash // 100
fifty = 61 // 50
ten = 11 // 10
one = 1
print(("№9"), hundred,"купюры по 100 рублей,", fifty, "купюра по 50 рублей,", ten, "купюра по 10 рублей,", one, "купюра по 1 рублю.")

